package kodesourceTasks.BasicPart1;

import java.nio.charset.Charset;

public class Task40 {

    /**
     * Напишите программу на Java, чтобы перечислить доступные наборы символов в объектах charset
     */


    public static void main(String[] args) {

        System.out.println(Charset.availableCharsets());
    }
}
