package kodesourceTasks.BasicPart1;

import java.time.LocalTime;

/**
 * Напишите программу на Java для отображения системного времени
 */
public class Task46 {

    public static void main(String[] args) {
        System.out.println(LocalTime.now());
    }
}
